In [29]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
%matplotlib inline

In [25]:
df=pd.read_csv('zippedData/bom.movie_gross.csv.gz')
df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [21]:
df2=pd.read_csv('zippedData/tn.movie_budgets.csv.gz')
df2.head(

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [26]:
df.loc[df.title == 'Megamind']

       title studio  domestic_gross foreign_gross  year
17  Megamind   P/DW     148400000.0     173500000  2010

In [27]:
df2.loc[df2.movie == 'Megamind']

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
246,47,"Nov 5, 2010",Megamind,"$130,000,000","$148,415,853","$321,887,208"

In [28]:
print(df.shape, df2.shape)

(3387, 5) (5782, 6)

In [31]:
np.intersect1d(df.title, df2.movie)

(1238,)

In [32]:
df3=pd.read_csv('zippedData/imdb.title.akas.csv.gz')

In [41]:
english_akas=df3.loc[df3.region == 'US']
english_akas.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
12,tt0369610,21,Jurassic World 3D,US,NaN,NaN,3-D version,0.0
20,tt0369610,29,Jurassic World,US,NaN,NaN,NaN,0.0
21,tt0369610,2,Ebb Tide,US,NaN,NaN,fake working title,0.0
28,tt0369610,36,Jurassic Park IV,US,NaN,working,NaN,0.0
37,tt0369610,44,Jurassic Park 4,US,NaN,NaN,informal alternative title,0.0

In [43]:
num_akas=english_akas.groupby('title_id').count().reset_index()
num_akas=num_akas.loc[num_akas.title > 1]

In [45]:
num_akas.shape

(3170, 8)